# StairsId Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
StairsPath..::..StairsId Property
StairsPath Class See Also
---
The host stairs element id.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public LinkElementId StairsId { get; }
```

Visual Basic
---
```text
Public ReadOnly Property StairsId As LinkElementId
	Get
```

Visual C++
---
```text
public:
property LinkElementId^ StairsId {
	LinkElementId^ get ();
}
```

# See Also
StairsPath Class
Autodesk.Revit.DB.Architecture Namespace